# GetSurfaceDistance Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings..::..GetSurfaceDistance Method
DefaultDivideSettings Class See Also
---
Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double GetSurfaceDistance(
	UVGridlineType gridlines
)
```

Visual Basic
---
```text
Public Function GetSurfaceDistance ( _
	gridlines As UVGridlineType _
) As Double
```

Visual C++
---
```text
public:
double GetSurfaceDistance(
	UVGridlineType gridlines
)
```

# ### Parameters
gridlines
    Type: Autodesk.Revit.DB..::..UVGridlineType U-gridlines or V-gridlines.
# ### Return Value
The default distance for the layout.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace